tutorials/flowOverCylinder/cylinder/system/sampleDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


interpolationScheme cellPoint;

writeFormat     raw;

sampleSets
(
    uniform 
    {
        name            cutLine;
        axis            distance;
        start           (0 0.05 0.0005);
        end             (0.1 0.05 0.0005);
        nPoints         100;
    }
);

fields
(
    p
);


// ************************************************************************* //
